# Usage:
#  $ brew bundle --global
#  $ brew bundle --global cleanup --force

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Most things
brew "ack"
brew "glide"
brew "jq"
brew "pstree"
brew "trash"
brew "tree"
brew "vim"
brew "wget"

# languages
brew "go"
brew "rust"
brew "rustfmt"

# Version control
brew "git"

# Modern command-line utils
# Mostly prefixed with 'g', e.g. gsha1sum, gtelnet
brew "coreutils"
brew "diffutils"
brew "inetutils"
brew "bash"
